<a href="https://colab.research.google.com/github/kvinne-anc/Data-Science-Notebooks/blob/main/Join_and_Shape_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:

#Join Data Practice
#These are the top 10 most frequently ordered products. How many times was each ordered?

#Banana
#Bag of Organic Bananas
#Organic Strawberries
#Organic Baby Spinach
#Organic Hass Avocado
#Organic Avocado
#Large Lemon
#Strawberries
#Limes
#Organic Whole Milk
#First, write down which columns you need and which dataframes have them.

#Next, merge these into a single dataframe.

#Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [ ]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
%matplotlib inline 
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-05-12 22:56:25--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.138.133
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.138.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  17.1MB/s    in 13s

2020-05-12 22:56:39 (15.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [ ]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [ ]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [ ]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [ ]:
#discovered that the 'aisles' and 'departments' files are pretty useless for this task so I eliminated them after exploring them

In [ ]:
opt = pd.read_csv('order_products__train.csv')
opt.head(10)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
5         1       13176                  6          0
6         1       47209                  7          0
7         1       22035                  8          1
8        36       39612                  1          0
9        36       19660                  2          1

In [ ]:
opp = pd.read_csv('order_products__prior.csv')
opp.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [ ]:
ord = pd.read_csv('orders.csv')
ord.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [ ]:
prod = pd.read_csv('products.csv')
prod.describe()

         product_id      aisle_id  department_id
count  49688.000000  49688.000000   49688.000000
mean   24844.500000     67.769582      11.728687
std    14343.834425     38.316162       5.850410
min        1.000000      1.000000       1.000000
25%    12422.750000     35.000000       7.000000
50%    24844.500000     69.000000      13.000000
75%    37266.250000    100.000000      17.000000
max    49688.000000    134.000000      21.000000

In [ ]:
#Attempting to explore the relevant column to find the exact food items - this didn't really help me but I wanted to try it anyway
food = prod[['product_name']]
food.head()

                                        product_name
0                         Chocolate Sandwich Cookies
1                                   All-Seasons Salt
2               Robust Golden Unsweetened Oolong Tea
3  Smart Ones Classic Favorites Mini Rigatoni Wit...
4                          Green Chile Anytime Sauce

In [ ]:
#attempting to group by food and limit this list to just those items - this also did not help 
opp.groupby('add_to_cart_order').head(10)

          order_id  product_id  add_to_cart_order  reordered
0                2       33120                  1          1
1                2       28985                  2          1
2                2        9327                  3          0
3                2       45918                  4          1
4                2       30035                  5          0
...            ...         ...                ...        ...
31363974   3308010       14242                111          1
31363975   3308010        5708                112          0
31363976   3308010       21019                113          1
31363977   3308010       13870                114          1
31363978   3308010       21137                115          1

[1205 rows x 4 columns]

In [ ]:
#I was finally able to pull out the individual products I needed - I want to figure out if I can do them all at once 
#Every attempt to combine them produced an error so I did each separately 
#I discovered that almost all of them are in aisle 24, dept 4 - so many those two sets could be useful after all - jk they're not

In [ ]:
banana = prod[(prod.product_name == 'Banana')]
banana

       product_id product_name  aisle_id  department_id
24851       24852       Banana        24              4

In [ ]:
bob = prod[(prod.product_name == 'Bag of Organic Bananas')]
bob

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4

In [ ]:
straw = prod[(prod.product_name == 'Strawberries')]
straw

       product_id  product_name  aisle_id  department_id
16796       16797  Strawberries        24              4

In [ ]:
ostraw = prod[(prod.product_name == 'Organic Strawberries')]
ostraw

       product_id          product_name  aisle_id  department_id
21136       21137  Organic Strawberries        24              4

In [ ]:
avo = prod[(prod.product_name == 'Avocado')]
avo

       product_id product_name  aisle_id  department_id
48526       48527      Avocado        24              4

In [ ]:
oha = prod[(prod.product_name == 'Organic Hass Avocado')]
oha

       product_id          product_name  aisle_id  department_id
47208       47209  Organic Hass Avocado        24              4

In [ ]:
lime = prod[(prod.product_name == 'Limes')]
lime

       product_id product_name  aisle_id  department_id
26208       26209        Limes        24              4

In [ ]:
lemon = prod[(prod.product_name == 'Large Lemon')]
lemon

       product_id product_name  aisle_id  department_id
47625       47626  Large Lemon        24              4

In [ ]:
milk = prod[(prod.product_name == 'Organic Whole Milk')]
milk

       product_id        product_name  aisle_id  department_id
27844       27845  Organic Whole Milk        84             16

In [ ]:
spinach = prod[(prod.product_name == 'Organic Baby Spinach')]
spinach

       product_id          product_name  aisle_id  department_id
21902       21903  Organic Baby Spinach       123              4

In [ ]:
#Everything is in Dept 4 with the exception of milk in dept 16

In [ ]:
#so, they are all in one list but now I need to get rid of the headings and unnecessary data 

food_list = [lemon, lime, milk, oha, avo, banana, bob, straw, ostraw, spinach] 
food_list

[       product_id product_name  aisle_id  department_id
 47625       47626  Large Lemon        24              4,
        product_id product_name  aisle_id  department_id
 26208       26209        Limes        24              4,
        product_id        product_name  aisle_id  department_id
 27844       27845  Organic Whole Milk        84             16,
        product_id          product_name  aisle_id  department_id
 47208       47209  Organic Hass Avocado        24              4,
        product_id product_name  aisle_id  department_id
 48526       48527      Avocado        24              4,
        product_id product_name  aisle_id  department_id
 24851       24852       Banana        24              4,
        product_id            product_name  aisle_id  department_id
 13175       13176  Bag of Organic Bananas        24              4,
        product_id  product_name  aisle_id  department_id
 16796       16797  Strawberries        24              4,
        product_id          product_name  aisle_id  department_id
 21136       21137  Organic Strawberries        24              4,
 Empty DataFrame
 Columns: [product_id, product_name, aisle_id, department_id]
 Index: []]

In [ ]:
#Well that sucks

In [ ]:
#combined these because they hold a lot of the same categories 

opp_opt = pd.concat([opp, opt], axis=0)
opp_opt.describe

<bound method NDFrame.describe of          order_id  product_id  add_to_cart_order  reordered
0               2       33120                  1          1
1               2       28985                  2          1
2               2        9327                  3          0
3               2       45918                  4          1
4               2       30035                  5          0
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[33819106 rows x 4 columns]>

In [ ]:
ord_prod = pd.concat([ord, prod], axis=0)
ord_prod.shape

(3470771, 11)

In [ ]:
#These product ids match the top foods product ids - tbh tho I don't understand what the second column output represents 
opp_opt['product_id'].value_counts()[:10]

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [ ]:
#Making list of the ids needed: 

Top_food = opp_opt['product_id'].value_counts()[:10].index.tolist()
Top_food

[24852, 13176, 21137, 21903, 47209, 47766, 47626, 16797, 26209, 27845]

In [ ]:
#Making list of top ids and cooresponding order info

condition = opp_opt['product_id'].isin(Top_food)
small_list = opp_opt[condition]
small_list.head(10)

     order_id  product_id  add_to_cart_order  reordered
12          3       21903                  4          1
30          5       13176                  1          1
51          5       47209                 22          0
77         10       24852                  1          1
80         10       47766                  4          1
83         10       21137                  7          1
126        14       27845                  2          1
170        18       47766                 27          1
180        20       24852                  6          0
190        22       24852                  3          1

In [ ]:
#The list has been merged on the common element (product id), inner because it's like joining two sets by the inner part of a venn diagram, but all data from both is included

merge1 = pd.merge(small_list, prod, on='product_id', how='inner')
merge1

         order_id  product_id  ...  aisle_id  department_id
0               3       21903  ...       123              4
1              26       21903  ...       123              4
2              31       21903  ...       123              4
3              39       21903  ...       123              4
4              56       21903  ...       123              4
...           ...         ...  ...       ...            ...
2418309   3418861       26209  ...        24              4
2418310   3418905       26209  ...        24              4
2418311   3419642       26209  ...        24              4
2418312   3420257       26209  ...        24              4
2418313   3420286       26209  ...        24              4

[2418314 rows x 7 columns]

In [ ]:
#Trying to make the dataset look better and display the info needed - it worked! 

fin_df = merge1['product_name'].value_counts(sort=True).to_frame()
fin_df = fin_df.reset_index()
fin_df.columns = ['product_name', 'amount ordered']
fin_df

             product_name  amount ordered
0                  Banana          491291
1  Bag of Organic Bananas          394930
2    Organic Strawberries          275577
3    Organic Baby Spinach          251705
4    Organic Hass Avocado          220877
5         Organic Avocado          184224
6             Large Lemon          160792
7            Strawberries          149445
8                   Limes          146660
9      Organic Whole Milk          142813